IDEA Open Model
BeamDataEc2 Class
Compatible with IDEA StatiCa 20.1
 Beam data Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.BeamDataEc2
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class BeamDataEc2
Public Class BeamDataEc2
The BeamDataEc2 type exposes the following members.
Constructors
Name | Description
BeamDataEc2
 constructor
Top
Properties
Name | Description
BeamSpanLength
 beam span lengrh - theoretical support distance
DeflectionSheme
 type of span loads
CheckLimitDeflection
 indicator for check of limit deflection for beam span
CheckLimitDeflRheoEffects
 true for check of limit deflection for beam span from rheological effects of variable loads
IsAbsValueLimitDeflection
 true for absolute user value of limit deflection (both - total + rheological)
IsUserLimitDeflection
 true for user value of limit deflection (both - total + rheological)
IsYDirectionData
 true for deflection data in Y direction
Ln
 Length of beam
RequiredCamber
 required camber
TypeOfCalculation
 there are several types of calculation
TypeOfSupportLeft
 Type of support on the left side
TypeOfSupportRight
 Type of support on the right side
UserLimitDeflection
 user value of limit deflection - denominator - 1 / value
UserLimitDeflRheoEffects
 user value of limit deflection from rheological effects of variable loads - denominator - 1 / value
WidthOfSupportLeft
 Width of support on the left side
WidthOfSupportRight
 Width of support on the right side
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace